<a href="https://colab.research.google.com/github/cyberfury/Kaggle/blob/main/Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [14]:
test_path="/content/drive/MyDrive/KaggleDownload/titanic/test.csv"
train_path="/content/drive/MyDrive/KaggleDownload/titanic/train.csv"

test_df=pd.read_csv(test_path)
train_df=pd.read_csv(train_path)

In [15]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [18]:
# 분류 문제 
# 로지스틱 / xg부스트 / 앙상블 사용해볼것
# 각 데이터를 수치형으로 변환
# 상관성이있는 데이터들을 추출
# 학습 후 예측

train_df['Sex']

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object

In [21]:
train_df['Sex']=train_df['Sex'].apply(lambda x: 0 if x=='male' else 1)

In [23]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    int64
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(6), object(4)
memory usage: 83.7+ KB

In [24]:
train_df['Embarked'].value_counts()
# 값이 없는 2개는 무시해도 될듯

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [34]:
# Embarked 을 원핫인코딩함. 
pd.concat([train_df,pd.get_dummies(train_df['Embarked'])],axis=1)

     PassengerId  Survived  Pclass  ...  C  Q  S
0              1         0       3  ...  0  0  1
1              2         1       1  ...  1  0  0
2              3         1       3  ...  0  0  1
3              4         1       1  ...  0  0  1
4              5         0       3  ...  0  0  1
..           ...       ...     ...  ... .. .. ..
886          887         0       2  ...  0  0  1
887          888         1       1  ...  0  0  1
888          889         0       3  ...  0  0  1
889          890         1       1  ...  1  0  0
890          891         0       3  ...  0  1  0

[891 rows x 15 columns]